edu.harvard.i2b2.eclipse.plugins.ontology/bin/test/rpdr/gen_getName_req.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header />
       <soapenv:Body>
        <rpdr:GetNameInfo xmlns:rpdr="http://rpdr.partners.org/">
            <rpdr:RequestXmlString><?xml version='1.0' encoding='utf-8'?>
                <ns2:request xmlns:ns4="http://www.i2b2.org/xsd/hive/plugin/"
                    xmlns:ns3="http://www.i2b2.org/xsd/cell/ont/v2/"
                    xmlns:ns2="http://www.i2b2.org/xsd/hive/msg/">
                    <message_header>
                        <i2b2_version_compatible>1.0</i2b2_version_compatible>
                        <hl7_version_compatible>2.4</hl7_version_compatible>
                        <sending_application>
                            <application_name>i2b2 Ontology</application_name>
                            <application_version>1.0</application_version>
                        </sending_application>
                        <sending_facility>
                            <facility_name>i2b2 Hive</facility_name>
                        </sending_facility>
                        <receiving_application>
                            <application_name>Ontology Cell</application_name>
                            <application_version>1.0</application_version>
                        </receiving_application>
                        <receiving_facility>
                            <facility_name>i2b2 Hive</facility_name>
                        </receiving_facility>
                        <datetime_of_message>2007-07-10T13:47:55.626-04:00</datetime_of_message>
                        <security>
                            <domain>partners</domain>
                            <username>demo</username>
                            <password>demouser</password>
                        </security>
                        <message_control_id>
                            <message_num>bcCDl0dB8M8GKEuOA1QC</message_num>
                            <instance_num>0</instance_num>
                        </message_control_id>
                        <processing_id>
                            <processing_id>P</processing_id>
                            <processing_mode>I</processing_mode>
                        </processing_id>
                        <accept_acknowledgement_type>AL</accept_acknowledgement_type>
                        <application_acknowledgement_type>AL</application_acknowledgement_type>
                        <country_code>US</country_code>
                    </message_header>
                    <request_header>
                        <result_waittime_ms>120000</result_waittime_ms>
                    </request_header>
                    <message_body>
                        <ns3:get_name_info blob="false" max="10" category="all"/>
                    </message_body>
                </ns2:request>
            </rpdr:RequestXmlString>
        </rpdr:GetNameInfo>
       </soapenv:Body>
</soapenv:Envelope>